# import 뭐시기

수사_종류 = ["양수사", "양수사-관형사", "서수사", "서수사-명사"]

일의자리_한자어 = {
    1 : '일',
    2 : '이',
    3 : '삼',
    4 : '사',
    5 : '오',
    6 : '육',
    7 : '칠',
    8 : '팔',
    9 : '구'
}

일의자리_고유어 = {
    1 : '하나',
    2 : '둘',
    3 : '셋',
    4 : '넷',
    5 : '다섯',
    6 : '여섯',
    7 : '일곱',
    8 : '여덟',
    9 : '아홉'
}

일의자리_고유어_관형사 = {
    1 : '한',
    2 : '두',
    3 : '세',
    4 : '네',
    5 : '다섯',
    6 : '여섯',
    7 : '일곱',
    8 : '여덟',
    9 : '아홉'
}

십의자리_고유어 = {
    1 : "열",
    2 : "스물",
    3 : "서른",
    4 : "마흔",
    5 : "쉰",
    6 : "예순",
    7 : "일흔",
    8 : "여든",
    9 : "아흔"
}

큰_자릿수 = {
    10 : "십",
    100 : "백",
    1000 : "천"
}

더큰_자릿수 = {
    10000 : "만",
    100000000 : "억",
    1000000000000 : "조",
    10000000000000000 : "경",
    100000000000000000000 : "해",
    1000000000000000000000000 : "자"
}

def convert(number, 수사="양수사", 한자어=True):
    if 수사 not in 수사_종류:
        raise NotImplementedError('없는 수사 종류에요 ㅜㅜ')

    if isinstance(number, (str, float)): #소수점 이하 읽기 추후 구현 예정
        number = int(number)
    if isinstance(number, (list, dict, tuple)):
        raise TypeError('잘못된 자료형이에요 ㅜㅜ')
    if number >= 10000000000000000000000000000:
        raise ValueError('너무 큰 수에요 ㅜㅜ')
    if isinstance(한자어, bool) == False:
        raise TypeError('잘못된 자료형이에요 ㅜㅜ')
    
    if 한자어 == True:
        pass
    else:
        pass
        

    # return [number, 수사, 한자어]
